public class Test3 {
    public static void main(String[] args) {
        // Javaでは数値リテラルにアンダースコアを含めることができる。
        // アンダースコアは桁区切りとして使用できるが、先頭や末尾には置けない。
        // 記号の直前や直後にもアンダースコアは置けない。
        int a = _123
        int b = 0b_01010
        int c = 0_123;
        int d = 0x1_1a;
        // floatの場合は末尾にFを付ける必要がある。
        // 何も指定しないと自動的にdouble型になる。
        // アンダースコアは数値リテラルの可読性を向上させるために使用される。
        // そのため、1_000_000の場合、1000000と同じ意味になる。
        float e = 1_000_000_F;
        int f = 0b1111_0000;
        int g = 0xFF_EE_DD_CC;
        int h = 3_.134F;
        long f = 1_000_000_000_L;
    }
}
